tap "nikitabobko/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
brew "colima", restart_service: :changed
brew "container", link: false
brew "docker-compose"
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "git"
brew "go"
brew "gstreamer"
brew "just"
brew "libdvdcss"
brew "markdownlint-cli2"
brew "media-info"
brew "mosh"
brew "neovim"
brew "ripgrep"
brew "signal-cli"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "zsh-completions"
cask "nikitabobko/tap/aerospace"
cask "claude"
cask "container"
cask "discord"
cask "ghostty"
cask "google-chrome"
cask "gstreamer-runtime"
cask "handbrake-app"
cask "lm-studio"
cask "mac-mouse-fix"
cask "rustdesk"
cask "signal"
cask "stolendata-mpv"
cask "transmission"
cask "zed"
